c++/template.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-26 Fri 19:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Templates and Generic Programming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bei Fang" />
<link rel="stylesheet" type="text/css" href="../style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Templates and Generic Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge3f6137">1. Function Templates</a>
<ul>
<li><a href="#org1c8401a">1.1. Define a Function Template</a></li>
<li><a href="#org5b04da0">1.2. Instantiating a Function Template</a></li>
<li><a href="#org50410c4">1.3. Nontype Template Parameters</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge3f6137" class="outline-2">
<h2 id="orge3f6137"><span class="section-number-2">1</span> Function Templates</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1c8401a" class="outline-3">
<h3 id="org1c8401a"><span class="section-number-3">1.1</span> Define a Function Template</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We define a compare function. As follow :
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt;
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">compare</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span> &amp;<span style="color: #a0522d;">v1</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span> &amp;<span style="color: #a0522d;">v2</span>) {
    <span style="color: #a020f0;">if</span> (v1 &lt; v2) <span style="color: #a020f0;">return</span> -1;
    <span style="color: #a020f0;">if</span> (v1 &gt; v2) <span style="color: #a020f0;">return</span> 1;
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
<p>
A template definition starts with the keyword template followed by a template
parameter list, note that the template parameter list cannot be empty. The keyword
typename can be replaced by keyword class. T is a general type. Which actual
type T represents is determined at complie time base on how compare is used.
</p>
</div>
</div>
<div id="outline-container-org5b04da0" class="outline-3">
<h3 id="org5b04da0"><span class="section-number-3">1.2</span> Instantiating a Function Template</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-c++">cout &lt;&lt; compare(1, 0) &lt;&lt; endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">T is int</span>
</pre>
</div>
<p>
When we call a function template, the compiler uses the arguments of the
call to deduce the template argument(s) for us. The above code indicates
the arguments have type int. The compiler will deduce int as the template
argument and will bind that argument to the template parameter T.
</p>
</div>
</div>
<div id="outline-container-org50410c4" class="outline-3">
<h3 id="org50410c4"><span class="section-number-3">1.3</span> Nontype Template Parameters</h3>
<div class="outline-text-3" id="text-1-3">
<p>
A nontype parameter represents a value rather than a type. As an example, 
we can write a version of compare that will handle string literals, as follow :
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a020f0;">template</span> &lt;<span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">N</span>, <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">M</span>&gt;
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">compare</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> (&amp;<span style="color: #a0522d;">p1</span>)[N], <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> (&amp;<span style="color: #a0522d;">p2</span>)[M]) {
    <span style="color: #a020f0;">return</span> strcmp(p1, p2);
}
</pre>
</div>
<p>
When we call this version of compare :
</p>
<div class="org-src-container">
<pre class="src src-c++">compare(<span style="color: #8b2252;">"hello"</span>, <span style="color: #8b2252;">"world"</span>)
</pre>
</div>
<p>
the compiler will use the size of the literals to instantiate a version of the
template with the sizes substituted for N and M. the compiler will instantiate
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">compare</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> (&amp;<span style="color: #a0522d;">p1</span>)[6], <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> (&amp;<span style="color: #a0522d;">p2</span>)[6])
</pre>
</div>
<p>
Because the compiler inserts a null terminator at the end of a string literal, so
it's six.
</p>

<p>
A nontype parameter may be an integral type, or a pointer or (lvalue)reference to an object
or to a funtion type. An argument bound to a nontype integral parameter must be a constant
expression. Arguments bound to a pointer or reference nontype parameter must have static
lifetime()
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bei Fang</p>
<p class="date">Created: 2019-07-26 Fri 19:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
